MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAL169/mcu.h
extern volatile __C1FIFOCI2bits_t C1FIFOCI2bits __asm__ ("C1FIFOCI2") __attribute__((section("sfrs"), address(0xBF880400)));
extern volatile uint32_t        C1FIFOCI2CLR __attribute__((section("sfrs"),address(0xBF880404)));
extern volatile uint32_t        C1FIFOCI2SET __attribute__((section("sfrs"),address(0xBF880408)));
extern volatile uint32_t        C1FIFOCI2INV __attribute__((section("sfrs"),address(0xBF88040C)));
#define C1FIFOCON3 C1FIFOCON3
extern volatile uint32_t   C1FIFOCON3 __attribute__((section("sfrs"), address(0xBF880410)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON3bits_t;
extern volatile __C1FIFOCON3bits_t C1FIFOCON3bits __asm__ ("C1FIFOCON3") __attribute__((section("sfrs"), address(0xBF880410)));
extern volatile uint32_t        C1FIFOCON3CLR __attribute__((section("sfrs"),address(0xBF880414)));
extern volatile uint32_t        C1FIFOCON3SET __attribute__((section("sfrs"),address(0xBF880418)));
extern volatile uint32_t        C1FIFOCON3INV __attribute__((section("sfrs"),address(0xBF88041C)));
#define C1FIFOINT3 C1FIFOINT3
extern volatile uint32_t   C1FIFOINT3 __attribute__((section("sfrs"), address(0xBF880420)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT3bits_t;
extern volatile __C1FIFOINT3bits_t C1FIFOINT3bits __asm__ ("C1FIFOINT3") __attribute__((section("sfrs"), address(0xBF880420)));
extern volatile uint32_t        C1FIFOINT3CLR __attribute__((section("sfrs"),address(0xBF880424)));
extern volatile uint32_t        C1FIFOINT3SET __attribute__((section("sfrs"),address(0xBF880428)));
extern volatile uint32_t        C1FIFOINT3INV __attribute__((section("sfrs"),address(0xBF88042C)));
#define C1FIFOUA3 C1FIFOUA3
extern volatile uint32_t   C1FIFOUA3 __attribute__((section("sfrs"), address(0xBF880430)));
extern volatile uint32_t        C1FIFOUA3CLR __attribute__((section("sfrs"),address(0xBF880434)));
extern volatile uint32_t        C1FIFOUA3SET __attribute__((section("sfrs"),address(0xBF880438)));
extern volatile uint32_t        C1FIFOUA3INV __attribute__((section("sfrs"),address(0xBF88043C)));
#define C1FIFOCI3 C1FIFOCI3
extern volatile uint32_t   C1FIFOCI3 __attribute__((section("sfrs"), address(0xBF880440)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI3bits_t;
extern volatile __C1FIFOCI3bits_t C1FIFOCI3bits __asm__ ("C1FIFOCI3") __attribute__((section("sfrs"), address(0xBF880440)));
extern volatile uint32_t        C1FIFOCI3CLR __attribute__((section("sfrs"),address(0xBF880444)));
extern volatile uint32_t        C1FIFOCI3SET __attribute__((section("sfrs"),address(0xBF880448)));
extern volatile uint32_t        C1FIFOCI3INV __attribute__((section("sfrs"),address(0xBF88044C)));
#define C1FIFOCON4 C1FIFOCON4
extern volatile uint32_t   C1FIFOCON4 __attribute__((section("sfrs"), address(0xBF880450)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON4bits_t;
extern volatile __C1FIFOCON4bits_t C1FIFOCON4bits __asm__ ("C1FIFOCON4") __attribute__((section("sfrs"), address(0xBF880450)));
extern volatile uint32_t        C1FIFOCON4CLR __attribute__((section("sfrs"),address(0xBF880454)));
extern volatile uint32_t        C1FIFOCON4SET __attribute__((section("sfrs"),address(0xBF880458)));
extern volatile uint32_t        C1FIFOCON4INV __attribute__((section("sfrs"),address(0xBF88045C)));
#define C1FIFOINT4 C1FIFOINT4
extern volatile uint32_t   C1FIFOINT4 __attribute__((section("sfrs"), address(0xBF880460)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT4bits_t;
extern volatile __C1FIFOINT4bits_t C1FIFOINT4bits __asm__ ("C1FIFOINT4") __attribute__((section("sfrs"), address(0xBF880460)));
extern volatile uint32_t        C1FIFOINT4CLR __attribute__((section("sfrs"),address(0xBF880464)));
extern volatile uint32_t        C1FIFOINT4SET __attribute__((section("sfrs"),address(0xBF880468)));
extern volatile uint32_t        C1FIFOINT4INV __attribute__((section("sfrs"),address(0xBF88046C)));
#define C1FIFOUA4 C1FIFOUA4
extern volatile uint32_t   C1FIFOUA4 __attribute__((section("sfrs"), address(0xBF880470)));
extern volatile uint32_t        C1FIFOUA4CLR __attribute__((section("sfrs"),address(0xBF880474)));
extern volatile uint32_t        C1FIFOUA4SET __attribute__((section("sfrs"),address(0xBF880478)));
extern volatile uint32_t        C1FIFOUA4INV __attribute__((section("sfrs"),address(0xBF88047C)));
#define C1FIFOCI4 C1FIFOCI4
extern volatile uint32_t   C1FIFOCI4 __attribute__((section("sfrs"), address(0xBF880480)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI4bits_t;
